In [1]:
import pandas as pd

In [4]:
data = pd.read_csv("artwork_sample.csv")

In [5]:
data.head()

,id,accession_number,artist,artistRole,artistId,title,dateText,medium,creditLine,year,acquisitionYear,dimensions,width,height,depth,units,inscription,thumbnailCopyright,thumbnailUrl,url
0,1035,A00001,"Blake, Robert",artist,38,A Figure Bowing before a Seated Old Man with h...,date not known,"Watercolour, ink, chalk and graphite on paper....",Presented by Mrs John Richmond 1922,NaN,1922,support: 394 x 419 mm,394,419,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-a-fi...
1,1036,A00002,"Blake, Robert",artist,38,"Two Drawings of Frightened Figures, Probably f...",date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922,support: 311 x 213 mm,311,213,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-two-...
2,1037,A00003,"Blake, Robert",artist,38,The Preaching of Warning. Verso: An Old Man En...,?c.1785,Graphite on paper. Verso: graphite on paper,Presented by Mrs John Richmond 1922,1785.0,1922,support: 343 x 467 mm,343,467,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-the-...
3,1038,A00004,"Blake, Robert",artist,38,Six Drawings of Figures with Outstretched Arms,date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922,support: 318 x 394 mm,318,394,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-six-...
4,1039,A00005,"Blake, William",artist,39,The Circle of the Lustful: Francesca da Rimini...,"1826–7, reprinted 1892",Line engraving on paper,Purchased with the assistance of a special gra...,1826.0,1919,image: 243 x 335 mm,243,335,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-the-...

In [6]:
#select only specific columns
data.filter(items = ["id", "artist"]) #select only 2 columns

     id          artist
0  1035   Blake, Robert
1  1036   Blake, Robert
2  1037   Blake, Robert
3  1038   Blake, Robert
4  1039  Blake, William
5  1040  Blake, William
6  1041  Blake, William
7  1042  Blake, William
8  1043  Blake, William
9  1044  Blake, William

In [7]:
#we can select columns with values contain in column name
data.filter(like = "artist") #select all the column with 'artist' in column's name

           artist artistRole  artistId
0   Blake, Robert     artist        38
1   Blake, Robert     artist        38
2   Blake, Robert     artist        38
3   Blake, Robert     artist        38
4  Blake, William     artist        39
5  Blake, William     artist        39
6  Blake, William     artist        39
7  Blake, William     artist        39
8  Blake, William     artist        39
9  Blake, William     artist        39

In [8]:
#we can use regex to get the case-insensitive values in column's name
data.filter(regex = "(?i)year") #return every column with year in column's name, ignore case (year, Year)

     year  acquisitionYear
0     NaN             1922
1     NaN             1922
2  1785.0             1922
3     NaN             1922
4  1826.0             1919
5  1826.0             1919
6  1826.0             1919
7  1826.0             1919
8  1826.0             1919
9  1826.0             1919

In [9]:
#select row
data.filter(axis = 0, regex = "^100.$") #axis = 0: row, axis = 1: column (by default)

Empty DataFrame
Columns: [id, accession_number, artist, artistRole, artistId, title, dateText, medium, creditLine, year, acquisitionYear, dimensions, width, height, depth, units, inscription, thumbnailCopyright, thumbnailUrl, url]
Index: []